Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP256MU202.h
/* AD1CON2 */
#define _ALTS AD1CON2bits.ALTS
#define _BUFM AD1CON2bits.BUFM
#define _SMPI AD1CON2bits.SMPI
#define _BUFS AD1CON2bits.BUFS
#define _CHPS AD1CON2bits.CHPS
#define _CSCNA AD1CON2bits.CSCNA
#define _VCFG AD1CON2bits.VCFG
#define _SMPI0 AD1CON2bits.SMPI0
#define _SMPI1 AD1CON2bits.SMPI1
#define _SMPI2 AD1CON2bits.SMPI2
#define _SMPI3 AD1CON2bits.SMPI3
#define _CHPS0 AD1CON2bits.CHPS0
#define _CHPS1 AD1CON2bits.CHPS1
#define _VCFG0 AD1CON2bits.VCFG0
#define _VCFG1 AD1CON2bits.VCFG1
#define _VCFG2 AD1CON2bits.VCFG2

/* AD1CON3 */
#define _ADCS AD1CON3bits.ADCS
#define _SAMC AD1CON3bits.SAMC
#define _ADRC AD1CON3bits.ADRC
#define _ADCS0 AD1CON3bits.ADCS0
#define _ADCS1 AD1CON3bits.ADCS1
#define _ADCS2 AD1CON3bits.ADCS2
#define _ADCS3 AD1CON3bits.ADCS3
#define _ADCS4 AD1CON3bits.ADCS4
#define _ADCS5 AD1CON3bits.ADCS5
#define _ADCS6 AD1CON3bits.ADCS6
#define _ADCS7 AD1CON3bits.ADCS7
#define _SAMC0 AD1CON3bits.SAMC0
#define _SAMC1 AD1CON3bits.SAMC1
#define _SAMC2 AD1CON3bits.SAMC2
#define _SAMC3 AD1CON3bits.SAMC3
#define _SAMC4 AD1CON3bits.SAMC4

/* AD1CHS123 */
#define _CH123SA0 AD1CHS123bits.CH123SA0
#define _CH123NA AD1CHS123bits.CH123NA
#define _CH123SA1 AD1CHS123bits.CH123SA1
#define _CH123SB0 AD1CHS123bits.CH123SB0
#define _CH123NB AD1CHS123bits.CH123NB
#define _CH123SB1 AD1CHS123bits.CH123SB1
#define _CH123NA0 AD1CHS123bits.CH123NA0
#define _CH123NA1 AD1CHS123bits.CH123NA1
#define _CH123NB0 AD1CHS123bits.CH123NB0
#define _CH123NB1 AD1CHS123bits.CH123NB1

/* AD1CHS0 */
#define _CH0SA AD1CHS0bits.CH0SA
#define _CH0NA AD1CHS0bits.CH0NA
#define _CH0SB AD1CHS0bits.CH0SB
#define _CH0NB AD1CHS0bits.CH0NB
#define _CH0SA0 AD1CHS0bits.CH0SA0
#define _CH0SA1 AD1CHS0bits.CH0SA1
#define _CH0SA2 AD1CHS0bits.CH0SA2
#define _CH0SA3 AD1CHS0bits.CH0SA3
#define _CH0SA4 AD1CHS0bits.CH0SA4
#define _CH0SA5 AD1CHS0bits.CH0SA5
#define _CH0SB0 AD1CHS0bits.CH0SB0
#define _CH0SB1 AD1CHS0bits.CH0SB1
#define _CH0SB2 AD1CHS0bits.CH0SB2
#define _CH0SB3 AD1CHS0bits.CH0SB3
#define _CH0SB4 AD1CHS0bits.CH0SB4
#define _CH0SB5 AD1CHS0bits.CH0SB5

/* AD1CSSH */
#define _CSS16 AD1CSSHbits.CSS16
#define _CSS17 AD1CSSHbits.CSS17
#define _CSS18 AD1CSSHbits.CSS18
#define _CSS19 AD1CSSHbits.CSS19
#define _CSS20 AD1CSSHbits.CSS20
#define _CSS21 AD1CSSHbits.CSS21
#define _CSS22 AD1CSSHbits.CSS22
#define _CSS23 AD1CSSHbits.CSS23
#define _CSS24 AD1CSSHbits.CSS24
#define _CSS25 AD1CSSHbits.CSS25
#define _CSS26 AD1CSSHbits.CSS26
#define _CSS27 AD1CSSHbits.CSS27
#define _CSS28 AD1CSSHbits.CSS28
#define _CSS29 AD1CSSHbits.CSS29
#define _CSS30 AD1CSSHbits.CSS30
#define _CSS31 AD1CSSHbits.CSS31

/* AD1CSSL */
#define _CSS0 AD1CSSLbits.CSS0
#define _CSS1 AD1CSSLbits.CSS1
#define _CSS2 AD1CSSLbits.CSS2
#define _CSS3 AD1CSSLbits.CSS3
#define _CSS4 AD1CSSLbits.CSS4
#define _CSS5 AD1CSSLbits.CSS5
#define _CSS6 AD1CSSLbits.CSS6
#define _CSS7 AD1CSSLbits.CSS7
#define _CSS8 AD1CSSLbits.CSS8
#define _CSS9 AD1CSSLbits.CSS9
#define _CSS10 AD1CSSLbits.CSS10
#define _CSS11 AD1CSSLbits.CSS11
#define _CSS12 AD1CSSLbits.CSS12
#define _CSS13 AD1CSSLbits.CSS13
#define _CSS14 AD1CSSLbits.CSS14
#define _CSS15 AD1CSSLbits.CSS15

/* AD1CON4 */
#define _DMABL AD1CON4bits.DMABL
#define _ADDMAEN AD1CON4bits.ADDMAEN
#define _DMABL0 AD1CON4bits.DMABL0
#define _DMABL1 AD1CON4bits.DMABL1
#define _DMABL2 AD1CON4bits.DMABL2

/* CTMUCON1 */
#define _CTTRIG CTMUCON1bits.CTTRIG
#define _IDISSEN CTMUCON1bits.IDISSEN
#define _EDGSEQEN CTMUCON1bits.EDGSEQEN
#define _EDGEN CTMUCON1bits.EDGEN
#define _TGEN CTMUCON1bits.TGEN
#define _CTMUSIDL CTMUCON1bits.CTMUSIDL
#define _CTMUEN CTMUCON1bits.CTMUEN

/* CTMUCON2 */
#define _EDG2SEL CTMUCON2bits.EDG2SEL
#define _EDG2POL CTMUCON2bits.EDG2POL
#define _EDG2MOD CTMUCON2bits.EDG2MOD
#define _EDG1STAT CTMUCON2bits.EDG1STAT
#define _EDG2STAT CTMUCON2bits.EDG2STAT
#define _EDG1SEL CTMUCON2bits.EDG1SEL
#define _EDG1POL CTMUCON2bits.EDG1POL
#define _EDG1MOD CTMUCON2bits.EDG1MOD
#define _EDG2SEL0 CTMUCON2bits.EDG2SEL0
#define _EDG2SEL1 CTMUCON2bits.EDG2SEL1
#define _EDG2SEL2 CTMUCON2bits.EDG2SEL2
#define _EDG2SEL3 CTMUCON2bits.EDG2SEL3
#define _EDG1SEL0 CTMUCON2bits.EDG1SEL0
#define _EDG1SEL1 CTMUCON2bits.EDG1SEL1
#define _EDG1SEL2 CTMUCON2bits.EDG1SEL2
#define _EDG1SEL3 CTMUCON2bits.EDG1SEL3

/* CTMUICON */
#define _IRNG CTMUICONbits.IRNG
#define _ITRIM CTMUICONbits.ITRIM
#define _IRNG0 CTMUICONbits.IRNG0
#define _IRNG1 CTMUICONbits.IRNG1
#define _ITRIM0 CTMUICONbits.ITRIM0
#define _ITRIM1 CTMUICONbits.ITRIM1
#define _ITRIM2 CTMUICONbits.ITRIM2
#define _ITRIM3 CTMUICONbits.ITRIM3
#define _ITRIM4 CTMUICONbits.ITRIM4
#define _ITRIM5 CTMUICONbits.ITRIM5

/* U1OTGIR */
#define _VBUSVDIF U1OTGIRbits.VBUSVDIF
#define _SESENDIF U1OTGIRbits.SESENDIF
#define _SESVDIF U1OTGIRbits.SESVDIF
#define _ACTVIF U1OTGIRbits.ACTVIF
#define _LSTATEIF U1OTGIRbits.LSTATEIF
#define _T1MSECIF U1OTGIRbits.T1MSECIF
#define _IDIF U1OTGIRbits.IDIF

/* U1OTGIE */
#define _VBUSVDIE U1OTGIEbits.VBUSVDIE
#define _SESENDIE U1OTGIEbits.SESENDIE
#define _SESVDIE U1OTGIEbits.SESVDIE
#define _ACTVIE U1OTGIEbits.ACTVIE
#define _LSTATEIE U1OTGIEbits.LSTATEIE
#define _T1MSECIE U1OTGIEbits.T1MSECIE
#define _IDIE U1OTGIEbits.IDIE

/* U1OTGSTAT */
#define _VBUSVD U1OTGSTATbits.VBUSVD
#define _SESEND U1OTGSTATbits.SESEND
#define _SESVD U1OTGSTATbits.SESVD
#define _LSTATE U1OTGSTATbits.LSTATE
#define _ID U1OTGSTATbits.ID

/* U1OTGCON */
#define _VBUSDIS U1OTGCONbits.VBUSDIS
#define _VBUSCHG U1OTGCONbits.VBUSCHG
#define _OTGEN U1OTGCONbits.OTGEN
#define _VBUSON U1OTGCONbits.VBUSON
#define _DMPULDWN U1OTGCONbits.DMPULDWN
#define _DPPULDWN U1OTGCONbits.DPPULDWN
#define _DMPULUP U1OTGCONbits.DMPULUP
#define _DPPULUP U1OTGCONbits.DPPULUP

/* U1PWRC */
#define _USBPWR U1PWRCbits.USBPWR
#define _USUSPND U1PWRCbits.USUSPND
#define _USLPGRD U1PWRCbits.USLPGRD
#define _UACTPND U1PWRCbits.UACTPND
#define _USUSPEND U1PWRCbits.USUSPEND

/* U1IR */
#define _URSTIF U1IRbits.URSTIF
#define _UERRIF U1IRbits.UERRIF
#define _SOFIF U1IRbits.SOFIF
#define _TRNIF U1IRbits.TRNIF
#define _IDLEIF U1IRbits.IDLEIF
#define _RESUMEIF U1IRbits.RESUMEIF
#define _STALLIF U1IRbits.STALLIF
#define _DETACHIF U1IRbits.DETACHIF
#define _ATTACHIF U1IRbits.ATTACHIF

/* U1IE */
#define _URSTIE U1IEbits.URSTIE
#define _UERRIE U1IEbits.UERRIE
#define _SOFIE U1IEbits.SOFIE
#define _TRNIE U1IEbits.TRNIE
#define _IDLEIE U1IEbits.IDLEIE
#define _RESUMEIE U1IEbits.RESUMEIE
#define _STALLIE U1IEbits.STALLIE
#define _DETACHIE U1IEbits.DETACHIE
#define _ATTACHIE U1IEbits.ATTACHIE

