Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP256MU202.h
#define _QEI1STAT_IDXIRQ_POSITION                0x00000001
#define _QEI1STAT_IDXIRQ_MASK                    0x00000002
#define _QEI1STAT_IDXIRQ_LENGTH                  0x00000001

#define _QEI1STAT_HOMIEN_POSITION                0x00000002
#define _QEI1STAT_HOMIEN_MASK                    0x00000004
#define _QEI1STAT_HOMIEN_LENGTH                  0x00000001

#define _QEI1STAT_HOMIRQ_POSITION                0x00000003
#define _QEI1STAT_HOMIRQ_MASK                    0x00000008
#define _QEI1STAT_HOMIRQ_LENGTH                  0x00000001

#define _QEI1STAT_VELOVIEN_POSITION              0x00000004
#define _QEI1STAT_VELOVIEN_MASK                  0x00000010
#define _QEI1STAT_VELOVIEN_LENGTH                0x00000001

#define _QEI1STAT_VELOVIRQ_POSITION              0x00000005
#define _QEI1STAT_VELOVIRQ_MASK                  0x00000020
#define _QEI1STAT_VELOVIRQ_LENGTH                0x00000001

#define _QEI1STAT_PCIIEN_POSITION                0x00000006
#define _QEI1STAT_PCIIEN_MASK                    0x00000040
#define _QEI1STAT_PCIIEN_LENGTH                  0x00000001

#define _QEI1STAT_PCIIRQ_POSITION                0x00000007
#define _QEI1STAT_PCIIRQ_MASK                    0x00000080
#define _QEI1STAT_PCIIRQ_LENGTH                  0x00000001

#define _QEI1STAT_POSOVIEN_POSITION              0x00000008
#define _QEI1STAT_POSOVIEN_MASK                  0x00000100
#define _QEI1STAT_POSOVIEN_LENGTH                0x00000001

#define _QEI1STAT_POSOVIRQ_POSITION              0x00000009
#define _QEI1STAT_POSOVIRQ_MASK                  0x00000200
#define _QEI1STAT_POSOVIRQ_LENGTH                0x00000001

#define _QEI1STAT_PCLEQIEN_POSITION              0x0000000A
#define _QEI1STAT_PCLEQIEN_MASK                  0x00000400
#define _QEI1STAT_PCLEQIEN_LENGTH                0x00000001

#define _QEI1STAT_PCLEQIRQ_POSITION              0x0000000B
#define _QEI1STAT_PCLEQIRQ_MASK                  0x00000800
#define _QEI1STAT_PCLEQIRQ_LENGTH                0x00000001

#define _QEI1STAT_PCHEQIEN_POSITION              0x0000000C
#define _QEI1STAT_PCHEQIEN_MASK                  0x00001000
#define _QEI1STAT_PCHEQIEN_LENGTH                0x00000001

#define _QEI1STAT_PCHEQIRQ_POSITION              0x0000000D
#define _QEI1STAT_PCHEQIRQ_MASK                  0x00002000
#define _QEI1STAT_PCHEQIRQ_LENGTH                0x00000001

#define _I2C1CON_SEN_POSITION                    0x00000000
#define _I2C1CON_SEN_MASK                        0x00000001
#define _I2C1CON_SEN_LENGTH                      0x00000001

#define _I2C1CON_RSEN_POSITION                   0x00000001
#define _I2C1CON_RSEN_MASK                       0x00000002
#define _I2C1CON_RSEN_LENGTH                     0x00000001

#define _I2C1CON_PEN_POSITION                    0x00000002
#define _I2C1CON_PEN_MASK                        0x00000004
#define _I2C1CON_PEN_LENGTH                      0x00000001

#define _I2C1CON_RCEN_POSITION                   0x00000003
#define _I2C1CON_RCEN_MASK                       0x00000008
#define _I2C1CON_RCEN_LENGTH                     0x00000001

#define _I2C1CON_ACKEN_POSITION                  0x00000004
#define _I2C1CON_ACKEN_MASK                      0x00000010
#define _I2C1CON_ACKEN_LENGTH                    0x00000001

#define _I2C1CON_ACKDT_POSITION                  0x00000005
#define _I2C1CON_ACKDT_MASK                      0x00000020
#define _I2C1CON_ACKDT_LENGTH                    0x00000001

#define _I2C1CON_STREN_POSITION                  0x00000006
#define _I2C1CON_STREN_MASK                      0x00000040
#define _I2C1CON_STREN_LENGTH                    0x00000001

#define _I2C1CON_GCEN_POSITION                   0x00000007
#define _I2C1CON_GCEN_MASK                       0x00000080
#define _I2C1CON_GCEN_LENGTH                     0x00000001

#define _I2C1CON_SMEN_POSITION                   0x00000008
#define _I2C1CON_SMEN_MASK                       0x00000100
#define _I2C1CON_SMEN_LENGTH                     0x00000001

#define _I2C1CON_DISSLW_POSITION                 0x00000009
#define _I2C1CON_DISSLW_MASK                     0x00000200
#define _I2C1CON_DISSLW_LENGTH                   0x00000001

#define _I2C1CON_A10M_POSITION                   0x0000000A
#define _I2C1CON_A10M_MASK                       0x00000400
#define _I2C1CON_A10M_LENGTH                     0x00000001

#define _I2C1CON_IPMIEN_POSITION                 0x0000000B
#define _I2C1CON_IPMIEN_MASK                     0x00000800
#define _I2C1CON_IPMIEN_LENGTH                   0x00000001

#define _I2C1CON_SCLREL_POSITION                 0x0000000C
#define _I2C1CON_SCLREL_MASK                     0x00001000
#define _I2C1CON_SCLREL_LENGTH                   0x00000001

#define _I2C1CON_I2CSIDL_POSITION                0x0000000D
#define _I2C1CON_I2CSIDL_MASK                    0x00002000
#define _I2C1CON_I2CSIDL_LENGTH                  0x00000001

#define _I2C1CON_I2CEN_POSITION                  0x0000000F
#define _I2C1CON_I2CEN_MASK                      0x00008000
#define _I2C1CON_I2CEN_LENGTH                    0x00000001

#define _I2C1STAT_TBF_POSITION                   0x00000000
#define _I2C1STAT_TBF_MASK                       0x00000001
#define _I2C1STAT_TBF_LENGTH                     0x00000001

#define _I2C1STAT_RBF_POSITION                   0x00000001
#define _I2C1STAT_RBF_MASK                       0x00000002
#define _I2C1STAT_RBF_LENGTH                     0x00000001

#define _I2C1STAT_R_W_POSITION                   0x00000002
#define _I2C1STAT_R_W_MASK                       0x00000004
#define _I2C1STAT_R_W_LENGTH                     0x00000001

#define _I2C1STAT_S_POSITION                     0x00000003
#define _I2C1STAT_S_MASK                         0x00000008
#define _I2C1STAT_S_LENGTH                       0x00000001

#define _I2C1STAT_P_POSITION                     0x00000004
#define _I2C1STAT_P_MASK                         0x00000010
#define _I2C1STAT_P_LENGTH                       0x00000001

#define _I2C1STAT_D_A_POSITION                   0x00000005
#define _I2C1STAT_D_A_MASK                       0x00000020
#define _I2C1STAT_D_A_LENGTH                     0x00000001

#define _I2C1STAT_I2COV_POSITION                 0x00000006
#define _I2C1STAT_I2COV_MASK                     0x00000040
#define _I2C1STAT_I2COV_LENGTH                   0x00000001

#define _I2C1STAT_IWCOL_POSITION                 0x00000007
#define _I2C1STAT_IWCOL_MASK                     0x00000080
#define _I2C1STAT_IWCOL_LENGTH                   0x00000001

